#### `success` Terraform Format and Style
#### `success` Terraform Initialization
#### ️`success` Terraform Validation
#### `success` Terraform Plan
#### Please check the service here: http://devops-page-test-317937924.us-east-2.elb.amazonaws.com

<details><summary>Show Plan</summary>

```terraform
[0m[1maws_route53_zone.main: Refreshing state... [id=Z04985212EFZ74WN4H7L2][0m
[0m[1maws_vpc.devops_page: Refreshing state... [id=vpc-0f9f2650c7097a3f0][0m
[0m[1maws_security_group.elb: Refreshing state... [id=sg-04b2466c9d5ccab07][0m
[0m[1maws_subnet.devops_page_a: Refreshing state... [id=subnet-0f7aa70d57166f2c9][0m
[0m[1maws_internet_gateway.gw: Refreshing state... [id=igw-0ada8da6ca038f707][0m
[0m[1maws_subnet.devops_page_c: Refreshing state... [id=subnet-0ca5bbf949fb34e49][0m
[0m[1maws_subnet.devops_page_b: Refreshing state... [id=subnet-0cfdad160b2de2b0c][0m
[0m[1maws_route_table.r: Refreshing state... [id=rtb-053fb7d02fa01c05d][0m
[0m[1maws_launch_configuration.devops-page: Refreshing state... [id=devops-page-test20210407110554571900000001][0m
[0m[1maws_elb.devops-page: Refreshing state... [id=devops-page-test][0m
[0m[1maws_route_table_association.a1: Refreshing state... [id=rtbassoc-0c1dc9bd71da533ca][0m
[0m[1maws_route_table_association.a2: Refreshing state... [id=rtbassoc-0386fbed87d703b3b][0m
[0m[1maws_route_table_association.a3: Refreshing state... [id=rtbassoc-02f8b49c0038a26c9][0m
[0m[1maws_route53_record.www: Refreshing state... [id=Z04985212EFZ74WN4H7L2_dlavrushko.com_A][0m
[0m[1maws_autoscaling_group.devops-page: Refreshing state... [id=devops-page-test][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_route53_record.www[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_route53_record" "www" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [33m~[0m [0m[1m[0mfqdn[0m[0m            = "dlavrushko.com" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m              = "Z04985212EFZ74WN4H7L2_dlavrushko.com_A" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m            = "dlavrushko.com" [33m->[0m [0m"dlavrushko.de" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mrecords[0m[0m         = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mttl[0m[0m             = 0 [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mzone_id[0m[0m         = "Z04985212EFZ74WN4H7L2" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_route53_zone.main[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_route53_zone" "main" {
      [33m~[0m [0m[1m[0mid[0m[0m            = "Z04985212EFZ74WN4H7L2" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m          = "dlavrushko.com" [33m->[0m [0m"dlavrushko.de" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mname_servers[0m[0m  = [
          [31m-[0m [0m"ns-1116.awsdns-11.org",
          [31m-[0m [0m"ns-1814.awsdns-34.co.uk",
          [31m-[0m [0m"ns-312.awsdns-39.com",
          [31m-[0m [0m"ns-939.awsdns-53.net",
        ] [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m          = {
            "Environment" = "prod"
        }
      [33m~[0m [0m[1m[0mzone_id[0m[0m       = "Z04985212EFZ74WN4H7L2" [33m->[0m [0m(known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @behoof4mind, Action: `pull_request`, Workflow: `Create PR Env`*